<?php

/*
|--------------------------------------------------------------------------
| Gaia的HTTP服务启动配置文件
|--------------------------------------------------------------------------
| 定义HTTP服务启动配置
|
*/

return [
    // 启用
    'enable'    => true,
    // 进程配置
    'config'    => [
        // 监听协议端口
        'listen'    => 'http://0.0.0.0:8080',
        // 额外参数
        'context'   => [],
        // 通信协议
        'transport' => 'tcp',
        // 进程数
        'count'     => \gaia\App::cpuCount() * 2,
        // 进程用户
        'user'      => '',
        // 进程用户组
        'group'     => '',
        // 是否开启端口复用
        'reusePort' => false,
    ]
];
